Revit 2026 API

# ThermalAssetElectricalResistivity Property

---

The electrical resistivity of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ElectricalResistivity { get; set; }
```
```vb
Public Property ElectricalResistivity As Double
	Get
	Set
```
```cpp
public:
property double ElectricalResistivity {
	double get ();
	void set (double value);
}
```
```fsharp
member ElectricalResistivity : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for electricalResistivity must be non-negative. |

Values are in ohm-meters and must be non-negative.

#### Reference

ThermalAsset Class

Autodesk.Revit.DB Namespace